docs/git-basics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-03 Sun 19:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>git-basics</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/zeroorone/style.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<meta name='theme-color' id='theme-color-meta' content='#f5f5f5'>
   <header>
    <nav class='breadcrumb'>
      <a href='/zeroorone/index.html'>Home</a>
      <span class='breadcrumb-sep'>/</span>
      <span class='breadcrumb-current'>git-basics</span>
    </nav>
    <div class='controls'>
      <button class='sidebar-toggle' title='Search'>
        <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path fill-rule='evenodd' clip-rule='evenodd' d='M18.319 14.4326C20.7628 11.2941 20.542 6.75347 17.6569 3.86829C14.5327 0.744098 9.46734 0.744098 6.34315 3.86829C3.21895 6.99249 3.21895 12.0578 6.34315 15.182C9.22833 18.0672 13.769 18.2879 16.9075 15.8442C16.921 15.8595 16.9351 15.8745 16.9497 15.8891L21.1924 20.1317C21.5829 20.5223 22.2161 20.5223 22.6066 20.1317C22.9971 19.7412 22.9971 19.1081 22.6066 18.7175L18.364 14.4749C18.3493 14.4603 18.3343 14.4462 18.319 14.4326ZM16.2426 5.28251C18.5858 7.62565 18.5858 11.4246 16.2426 13.7678C13.8995 16.1109 10.1005 16.1109 7.75736 13.7678C5.41421 11.4246 5.41421 7.62565 7.75736 5.28251C10.1005 2.93936 13.8995 2.93936 16.2426 5.28251Z' fill='currentColor'/>
        </svg>
      </button>

      <button class='theme-toggle' title='Toggle Theme'>
        <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path d='M12 16C14.2091 16 16 14.2091 16 12C16 9.79086 14.2091 8 12 8V16Z' fill='currentColor'/>
          <path fill-rule='evenodd' clip-rule='evenodd' d='M12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2ZM12 4V8C9.79086 8 8 9.79086 8 12C8 14.2091 9.79086 16 12 16V20C16.4183 20 20 16.4183 20 12C20 7.58172 16.4183 4 12 4Z' fill='currentColor'/>
        </svg>
      </button>

      <button class='toc-toggle' title='Table of Contents'>
        <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path d='M2 6C2 5.44772 2.44772 5 3 5H21C21.5523 5 22 5.44772 22 6C22 6.55228 21.5523 7 21 7H3C2.44772 7 2 6.55228 2 6Z' fill='currentColor'/>
          <path d='M2 12.0322C2 11.4799 2.44772 11.0322 3 11.0322H21C21.5523 11.0322 22 11.4799 22 12.0322C22 12.5845 21.5523 13.0322 21 13.0322H3C2.44772 13.0322 2 12.5845 2 12.0322Z' fill='currentColor'/>
          <path d='M3 17.0645C2.44772 17.0645 2 17.5122 2 18.0645C2 18.6167 2.44772 19.0645 3 19.0645H21C21.5523 19.0645 22 18.6167 22 18.0645C22 17.5122 21.5523 17.0645 21 17.0645H3Z' fill='currentColor'/>
        </svg>
      </button>
    </div>
  </header>

  <aside id='left-sidebar'>
    <div class='sidebar-header'>
      <h3>Search & Tags</h3>
      <button class='sidebar-close' title='Close'>
        <svg width='20' height='20' viewBox='0 0 15 15' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path fill-rule='evenodd' clip-rule='evenodd' d='M11.7816 4.03157C12.0062 3.80702 12.0062 3.44295 11.7816 3.2184C11.5571 2.99385 11.193 2.99385 10.9685 3.2184L7.50005 6.68682L4.03164 3.2184C3.80708 2.99385 3.44301 2.99385 3.21846 3.2184C2.99391 3.44295 2.99391 3.80702 3.21846 4.03157L6.68688 7.49999L3.21846 10.9684C2.99391 11.193 2.99391 11.557 3.21846 11.7816C3.44301 12.0061 3.80708 12.0061 4.03164 11.7816L7.50005 8.31316L10.9685 11.7816C11.193 12.0061 11.5571 12.0061 11.7816 11.7816C12.0062 11.557 12.0062 11.193 11.7816 10.9684L8.31322 7.49999L11.7816 4.03157Z' fill='currentColor'/>
        </svg>
      </button>
    </div>
    <div class='search-container'>
      <input type='text' id='sidebar-search' placeholder='Search full content or #tags...' autocomplete='off'>
    </div>
    <div id='sidebar-tags' class='tag-cloud'></div>
    <ul id='sidebar-results'></ul>
  </aside>
</div>
<div id="content" class="content">
<h1 class="title">git-basics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb1ab9b5">Git Config</a>
<ul>
<li><a href="#orgbc78ac6">System, Global, local, worktree</a></li>
<li><a href="#org3007291">Get</a></li>
<li><a href="#orgcac7dd5">Unset</a></li>
<li><a href="#orgf8917b2">remove-section</a></li>
<li><a href="#org500291f">Unset-all</a></li>
</ul>
</li>
<li><a href="#org7f82f99">Git branching</a>
<ul>
<li><a href="#org53a2f96">New Branch</a></li>
<li><a href="#orga2fc5b5">Merge</a>
<ul>
<li><a href="#orga9f3a6d">Fastforwarsd merge</a></li>
</ul>
</li>
<li><a href="#org5991129">Delete a branch</a></li>
<li><a href="#org2256668">Rebase</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb1ab9b5" class="outline-2">
<h2 id="orgb1ab9b5">Git Config</h2>
<div class="outline-text-2" id="text-orgb1ab9b5">
<p>
Git stores author information so that when you're making a commit it can track who made the change. 
</p>

<p>
Let's take the command apart:
</p>

<p>
git config: The command to interact with your Git configuration.
set: The subcommand to set a value – i.e., to add it if it doesn't already exist, or update it if it does.
&#x2013;global: Flag stating you want this configuration to be stored globally in your ~/.gitconfig. The opposite is &#x2013;local, which stores the configuration in the current repository only.
user: The section.
name: The key within the section.
"ThePrimeagen": The value you want to set for the key.
</p>

<p>
Git has a command to view the contents of your config:
</p>

<p>
git config list &#x2013;local
</p>

<p>
You can also just view the contents of your local config file directly:
</p>

<p>
cat .git/config
</p>
</div>
<div id="outline-container-orgbc78ac6" class="outline-3">
<h3 id="orgbc78ac6">System, Global, local, worktree</h3>
<div class="outline-text-3" id="text-orgbc78ac6">
<p>
There are several locations where Git can be configured. From more general to more specific, they are:
</p>

<p>
system: <i>etc/gitconfig, a file that configures Git for all users on the system
global: ~</i>.gitconfig, a file that configures Git for all projects of a user
local: .git/config, a file that configures Git for a specific project
worktree: .git/config.worktree, a file that configures Git for part of a project
</p>

<p>
In my experience, 90% of the time you will be using &#x2013;global to set things like your username and email. The other 9% of the time you will be using &#x2013;local to set project-specific configurations. The last 1% of the time you might need to futz with system and worktree configurations, but it's extremely rare.
</p>
</div>
</div>
<div id="outline-container-org3007291" class="outline-3">
<h3 id="org3007291">Get</h3>
<div class="outline-text-3" id="text-org3007291">
<p>
We've used list to see all the configuration values, but the get subcommand is useful for getting a single value.
</p>

<p>
git config get &lt;key&gt;
</p>

<p>
Keys are in the format &lt;section&gt;.&lt;keyname&gt;.
</p>
</div>
</div>
<div id="outline-container-orgcac7dd5" class="outline-3">
<h3 id="orgcac7dd5">Unset</h3>
<div class="outline-text-3" id="text-orgcac7dd5">
<p>
Unset
</p>

<p>
The unset subcommand is used to remove a configuration value. For example:
</p>

<p>
git config unset &lt;key&gt;
</p>


<p>
Only works with section and a key <code>&lt;section&gt;.&lt;keyname&gt;</code>
</p>
</div>
</div>
<div id="outline-container-orgf8917b2" class="outline-3">
<h3 id="orgf8917b2">remove-section</h3>
<div class="outline-text-3" id="text-orgf8917b2">
<p>
<code>git config --remove-section &lt;section&gt;</code>
</p>
</div>
</div>
<div id="outline-container-org500291f" class="outline-3">
<h3 id="org500291f">Unset-all</h3>
<div class="outline-text-3" id="text-org500291f">
<p>
<code>git config --unset-all webflyx.ceo</code>
</p>

<p>
Removes all
</p>
</div>
</div>
</div>
<div id="outline-container-org7f82f99" class="outline-2">
<h2 id="org7f82f99">Git branching</h2>
<div class="outline-text-2" id="text-org7f82f99">
<p>
A Git branch allows you to keep track of different changes separately.
</p>

<p>
For example, let's say you have a big web project and you want to experiment with changing the color scheme. Instead of changing the entire project directly (as of right now, our master branch), you can create a new branch called color<sub>scheme</sub> and work on that branch. When you're done, if you like the changes, you can merge the color<sub>scheme</sub> branch back into the master branch to keep the changes. If you don't like the changes, you can simply delete the color<sub>scheme</sub> branch and go back to the master branch.
Under the Hood
</p>

<p>
A branch is just a named pointer to a specific commit. When you create a branch, you are creating a new pointer to a specific commit. The commit that the branch points to is called the tip of the branch.
Because a branch is just a pointer to a commit, they're lightweight and "cheap" resource-wise to create. When you create 10 branches, you're not creating 10 copies of your project on your hard drive.
</p>

<p>
Check which branch you're currently on by running:
</p>

<p>
<code>git branch</code>
</p>

<p>
Rename a branch
<code>git branch -m oldname newname</code>
</p>
</div>
<div id="outline-container-org53a2f96" class="outline-3">
<h3 id="org53a2f96">New Branch</h3>
<div class="outline-text-3" id="text-org53a2f96">
<p>
You should already be on the main branch: your "default" branch. You can always check with git branch.
Two Ways to Create a Branch
</p>

<p>
<code>git branch my_new_branch</code>
</p>

<p>
This creates a new branch called <code>my_new_branch</code>. The thing is, I rarely use this command because usually I want to create a branch and switch to it immediately. So I use this command instead:
</p>

<p>
<code>git switch -c my_new_branch</code>
</p>

<p>
<code>-c</code> is for create. Use without c to just switch.
</p>

<p>
The switch command allows you to switch branches. Including the -c flag tells Git to create a new branch and switch to it.
</p>

<p>
When you create a new branch, it uses the current commit you are on as the branch base. For example, if you're on your main branch with 3 commits, A, B, and C, and then you run <code>git switch -c my_new_branch</code>, your new branch will look like this:
</p>

<p>
Another way to switch
</p>

<p>
<code>git checkout prime</code>
</p>
</div>
</div>
<div id="outline-container-orga2fc5b5" class="outline-3">
<h3 id="orga2fc5b5">Merge</h3>
<div class="outline-text-3" id="text-orga2fc5b5">
<p>
<code>git merge branch_to_merge</code>
</p>

<p>
View the commits and merges
 <code>git log --oneline --decorate --graph --parents</code>
</p>
</div>
<div id="outline-container-orga9f3a6d" class="outline-4">
<h4 id="orga9f3a6d">Fastforwarsd merge</h4>
<div class="outline-text-4" id="text-orga9f3a6d">
<p>
The branch you are merging onto if the tip of that branch is the merge base - fast forward branch
Basically there is no branch.
</p>
</div>
</div>
</div>
<div id="outline-container-org5991129" class="outline-3">
<h3 id="org5991129">Delete a branch</h3>
<div class="outline-text-3" id="text-org5991129">
<p>
<code>git branch -d branch_name</code>
</p>



<p>
I need some notes of these
&#x2013;oneline
&#x2013;graph
&#x2013;parents
&#x2013;all
and other stuff that's very commonly used and would be useful
</p>
</div>
</div>
<div id="outline-container-org2256668" class="outline-3">
<h3 id="org2256668">Rebase</h3>
<div class="outline-text-3" id="text-org2256668">
<p>
Moves the branch to the tip of the base of the main branch that the feature branch is based on 
</p>

<p>
Visualizing Rebase
</p>

<p>
Say we have this commit history:
</p>

<div class="org-src-container">
<pre class="src src-bash">A - B - C    main
   <span class="org-sh-escaped-newline">\</span>
    D - E    feature_branch
</pre>
</div>

<p>
We're working on <code>feature_branch</code>, and want to bring in the changes our team added to main so we're not working with a stale branch. We could merge main into <code>feature_branch</code>, but that would create an additional merge commit. Rebase avoids a merge commit by replaying the commits from <code>feature_branch</code> on top of main. After a rebase, the history will look like this:
</p>

<div class="org-src-container">
<pre class="src src-bash">A - B - C         main
         <span class="org-sh-escaped-newline">\</span>
          D - E   feature_branch
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="footer">Built with Emacs</p>
</div>
</body>
</html>
